ForgetfulDuck/MIP-Watch/MIP-STM32/Core/Inc/lsm6dsr_reg.h
typedef enum
{
  LSM6DSR_HP_FILTER_NONE     = 0x00,
  LSM6DSR_HP_FILTER_16mHz    = 0x80,
  LSM6DSR_HP_FILTER_65mHz    = 0x81,
  LSM6DSR_HP_FILTER_260mHz   = 0x82,
  LSM6DSR_HP_FILTER_1Hz04    = 0x83,
} lsm6dsr_hpm_g_t;
int32_t lsm6dsr_gy_hp_path_internal_set(const stmdev_ctx_t *ctx,
                                        lsm6dsr_hpm_g_t val);
int32_t lsm6dsr_gy_hp_path_internal_get(const stmdev_ctx_t *ctx,
                                        lsm6dsr_hpm_g_t *val);

typedef enum
{
  LSM6DSR_AUX_PULL_UP_DISC       = 0,
  LSM6DSR_AUX_PULL_UP_CONNECT    = 1,
} lsm6dsr_ois_pu_dis_t;
int32_t lsm6dsr_aux_sdo_ocs_mode_set(const stmdev_ctx_t *ctx,
                                     lsm6dsr_ois_pu_dis_t val);
int32_t lsm6dsr_aux_sdo_ocs_mode_get(const stmdev_ctx_t *ctx,
                                     lsm6dsr_ois_pu_dis_t *val);

typedef enum
{
  LSM6DSR_AUX_ON                    = 1,
  LSM6DSR_AUX_ON_BY_AUX_INTERFACE   = 0,
} lsm6dsr_ois_on_t;
int32_t lsm6dsr_aux_pw_on_ctrl_set(const stmdev_ctx_t *ctx,
                                   lsm6dsr_ois_on_t val);
int32_t lsm6dsr_aux_pw_on_ctrl_get(const stmdev_ctx_t *ctx,
                                   lsm6dsr_ois_on_t *val);

int32_t lsm6dsr_aux_status_reg_get(const stmdev_ctx_t *ctx,
                                   lsm6dsr_status_spiaux_t *val);

int32_t lsm6dsr_aux_xl_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsr_aux_gy_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsr_aux_gy_flag_settling_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

typedef enum
{
  LSM6DSR_AUX_XL_DISABLE = 0,
  LSM6DSR_AUX_XL_POS     = 1,
  LSM6DSR_AUX_XL_NEG     = 2,
} lsm6dsr_st_xl_ois_t;
int32_t lsm6dsr_aux_xl_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6dsr_st_xl_ois_t val);
int32_t lsm6dsr_aux_xl_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6dsr_st_xl_ois_t *val);

typedef enum
{
  LSM6DSR_AUX_DEN_ACTIVE_LOW     = 0,
  LSM6DSR_AUX_DEN_ACTIVE_HIGH    = 1,
} lsm6dsr_den_lh_ois_t;
int32_t lsm6dsr_aux_den_polarity_set(const stmdev_ctx_t *ctx,
                                     lsm6dsr_den_lh_ois_t val);
int32_t lsm6dsr_aux_den_polarity_get(const stmdev_ctx_t *ctx,
                                     lsm6dsr_den_lh_ois_t *val);

typedef enum
{
  LSM6DSR_AUX_DEN_DISABLE         = 0,
  LSM6DSR_AUX_DEN_LEVEL_LATCH     = 3,
  LSM6DSR_AUX_DEN_LEVEL_TRIG      = 2,
} lsm6dsr_lvl2_ois_t;
int32_t lsm6dsr_aux_den_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_lvl2_ois_t val);
int32_t lsm6dsr_aux_den_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_lvl2_ois_t *val);

int32_t lsm6dsr_aux_drdy_on_int2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_aux_drdy_on_int2_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_AUX_DISABLE  = 0,
  LSM6DSR_MODE_3_GY    = 1,
  LSM6DSR_MODE_4_GY_XL = 3,
} lsm6dsr_ois_en_spi2_t;
int32_t lsm6dsr_aux_mode_set(const stmdev_ctx_t *ctx,
                             lsm6dsr_ois_en_spi2_t val);
int32_t lsm6dsr_aux_mode_get(const stmdev_ctx_t *ctx,
                             lsm6dsr_ois_en_spi2_t *val);

typedef enum
{
  LSM6DSR_125dps_AUX  =  0x04,
  LSM6DSR_250dps_AUX  =  0x00,
  LSM6DSR_500dps_AUX  =  0x01,
  LSM6DSR_1000dps_AUX =  0x02,
  LSM6DSR_2000dps_AUX =  0x03,
} lsm6dsr_fs_g_ois_t;
int32_t lsm6dsr_aux_gy_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsr_fs_g_ois_t val);
int32_t lsm6dsr_aux_gy_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsr_fs_g_ois_t *val);

typedef enum
{
  LSM6DSR_AUX_SPI_4_WIRE = 0,
  LSM6DSR_AUX_SPI_3_WIRE = 1,
} lsm6dsr_sim_ois_t;
int32_t lsm6dsr_aux_spi_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sim_ois_t val);
int32_t lsm6dsr_aux_spi_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sim_ois_t *val);

typedef enum
{
  LSM6DSR_351Hz39 = 0,
  LSM6DSR_236Hz63 = 1,
  LSM6DSR_172Hz70 = 2,
  LSM6DSR_937Hz91 = 3,
} lsm6dsr_ftype_ois_t;
int32_t lsm6dsr_aux_gy_lp1_bandwidth_set(const stmdev_ctx_t *ctx,
                                         lsm6dsr_ftype_ois_t val);
int32_t lsm6dsr_aux_gy_lp1_bandwidth_get(const stmdev_ctx_t *ctx,
                                         lsm6dsr_ftype_ois_t *val);

typedef enum
{
  LSM6DSR_AUX_HP_DISABLE = 0x00,
  LSM6DSR_AUX_HP_Hz016   = 0x10,
  LSM6DSR_AUX_HP_Hz065   = 0x11,
  LSM6DSR_AUX_HP_Hz260   = 0x12,
  LSM6DSR_AUX_HP_1Hz040  = 0x13,
} lsm6dsr_hpm_ois_t;
int32_t lsm6dsr_aux_gy_hp_bandwidth_set(const stmdev_ctx_t *ctx,
                                        lsm6dsr_hpm_ois_t val);
int32_t lsm6dsr_aux_gy_hp_bandwidth_get(const stmdev_ctx_t *ctx,
                                        lsm6dsr_hpm_ois_t *val);

typedef enum
{
  LSM6DSR_ENABLE_CLAMP  = 0,
  LSM6DSR_DISABLE_CLAMP = 1,
} lsm6dsr_st_ois_clampdis_t;
int32_t lsm6dsr_aux_gy_clamp_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_st_ois_clampdis_t val);
int32_t lsm6dsr_aux_gy_clamp_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_st_ois_clampdis_t *val);

typedef enum
{
  LSM6DSR_AUX_GY_DISABLE = 0,
  LSM6DSR_AUX_GY_POS     = 1,
  LSM6DSR_AUX_GY_NEG     = 3,
} lsm6dsr_st_ois_t;
int32_t lsm6dsr_aux_gy_self_test_set(const stmdev_ctx_t *ctx,
                                     lsm6dsr_st_ois_t val);
int32_t lsm6dsr_aux_gy_self_test_get(const stmdev_ctx_t *ctx,
                                     lsm6dsr_st_ois_t *val);

typedef enum
{
  LSM6DSR_631Hz = 0,
  LSM6DSR_295Hz = 1,
  LSM6DSR_140Hz = 2,
  LSM6DSR_68Hz2 = 3,
  LSM6DSR_33Hz6 = 4,
  LSM6DSR_16Hz7 = 5,
  LSM6DSR_8Hz3  = 6,
  LSM6DSR_4Hz11 = 7,
} lsm6dsr_filter_xl_conf_ois_t;
int32_t lsm6dsr_aux_xl_bandwidth_set(const stmdev_ctx_t *ctx,
                                     lsm6dsr_filter_xl_conf_ois_t val);
int32_t lsm6dsr_aux_xl_bandwidth_get(const stmdev_ctx_t *ctx,
                                     lsm6dsr_filter_xl_conf_ois_t *val);

