ForgetfulDuck/MIP-Watch/MIP-STM32/Core/Inc/lsm6dsr_reg.h
typedef enum
{
  LSM6DSR_AUX_2g  = 0,
  LSM6DSR_AUX_16g = 1,
  LSM6DSR_AUX_4g  = 2,
  LSM6DSR_AUX_8g  = 3,
} lsm6dsr_fs_xl_ois_t;
int32_t lsm6dsr_aux_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                      lsm6dsr_fs_xl_ois_t val);
int32_t lsm6dsr_aux_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                      lsm6dsr_fs_xl_ois_t *val);

typedef enum
{
  LSM6DSR_PULL_UP_DISC       = 0,
  LSM6DSR_PULL_UP_CONNECT    = 1,
} lsm6dsr_sdo_pu_en_t;
int32_t lsm6dsr_sdo_sa0_mode_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sdo_pu_en_t val);
int32_t lsm6dsr_sdo_sa0_mode_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sdo_pu_en_t *val);

typedef enum
{
  LSM6DSR_PULL_DOWN_CONNECT       = 0,
  LSM6DSR_PULL_DOWN_DISC          = 1,
} lsm6dsr_pd_dis_int1_t;
int32_t lsm6dsr_int1_mode_set(const stmdev_ctx_t *ctx,
                              lsm6dsr_pd_dis_int1_t val);
int32_t lsm6dsr_int1_mode_get(const stmdev_ctx_t *ctx,
                              lsm6dsr_pd_dis_int1_t *val);

typedef enum
{
  LSM6DSR_SPI_4_WIRE = 0,
  LSM6DSR_SPI_3_WIRE = 1,
} lsm6dsr_sim_t;
int32_t lsm6dsr_spi_mode_set(const stmdev_ctx_t *ctx,
                             lsm6dsr_sim_t val);
int32_t lsm6dsr_spi_mode_get(const stmdev_ctx_t *ctx,
                             lsm6dsr_sim_t *val);

typedef enum
{
  LSM6DSR_I2C_ENABLE  = 0,
  LSM6DSR_I2C_DISABLE = 1,
} lsm6dsr_i2c_disable_t;
int32_t lsm6dsr_i2c_interface_set(const stmdev_ctx_t *ctx,
                                  lsm6dsr_i2c_disable_t val);
int32_t lsm6dsr_i2c_interface_get(const stmdev_ctx_t *ctx,
                                  lsm6dsr_i2c_disable_t *val);

typedef enum
{
  LSM6DSR_I3C_DISABLE         = 0x80,
  LSM6DSR_I3C_ENABLE_T_50us   = 0x00,
  LSM6DSR_I3C_ENABLE_T_2us    = 0x01,
  LSM6DSR_I3C_ENABLE_T_1ms    = 0x02,
  LSM6DSR_I3C_ENABLE_T_25ms   = 0x03,
} lsm6dsr_i3c_disable_t;
int32_t lsm6dsr_i3c_disable_set(const stmdev_ctx_t *ctx,
                                lsm6dsr_i3c_disable_t val);
int32_t lsm6dsr_i3c_disable_get(const stmdev_ctx_t *ctx,
                                lsm6dsr_i3c_disable_t *val);

typedef struct
{
  lsm6dsr_int1_ctrl_t          int1_ctrl;
  lsm6dsr_md1_cfg_t            md1_cfg;
  lsm6dsr_emb_func_int1_t      emb_func_int1;
  lsm6dsr_fsm_int1_a_t         fsm_int1_a;
  lsm6dsr_fsm_int1_b_t         fsm_int1_b;
} lsm6dsr_pin_int1_route_t;
int32_t lsm6dsr_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                   lsm6dsr_pin_int1_route_t *val);
int32_t lsm6dsr_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                   lsm6dsr_pin_int1_route_t *val);

typedef struct
{
  lsm6dsr_int2_ctrl_t          int2_ctrl;
  lsm6dsr_md2_cfg_t            md2_cfg;
  lsm6dsr_emb_func_int2_t      emb_func_int2;
  lsm6dsr_fsm_int2_a_t         fsm_int2_a;
  lsm6dsr_fsm_int2_b_t         fsm_int2_b;
} lsm6dsr_pin_int2_route_t;
int32_t lsm6dsr_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                   lsm6dsr_pin_int2_route_t *val);
int32_t lsm6dsr_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                   lsm6dsr_pin_int2_route_t *val);

typedef enum
{
  LSM6DSR_PUSH_PULL   = 0,
  LSM6DSR_OPEN_DRAIN  = 1,
} lsm6dsr_pp_od_t;
int32_t lsm6dsr_pin_mode_set(const stmdev_ctx_t *ctx,
                             lsm6dsr_pp_od_t val);
int32_t lsm6dsr_pin_mode_get(const stmdev_ctx_t *ctx,
                             lsm6dsr_pp_od_t *val);

typedef enum
{
  LSM6DSR_ACTIVE_HIGH = 0,
  LSM6DSR_ACTIVE_LOW  = 1,
} lsm6dsr_h_lactive_t;
int32_t lsm6dsr_pin_polarity_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_h_lactive_t val);
int32_t lsm6dsr_pin_polarity_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_h_lactive_t *val);

int32_t lsm6dsr_all_on_int1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_all_on_int1_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_ALL_INT_PULSED            = 0,
  LSM6DSR_BASE_LATCHED_EMB_PULSED   = 1,
  LSM6DSR_BASE_PULSED_EMB_LATCHED   = 2,
  LSM6DSR_ALL_INT_LATCHED           = 3,
} lsm6dsr_lir_t;
int32_t lsm6dsr_int_notification_set(const stmdev_ctx_t *ctx,
                                     lsm6dsr_lir_t val);
int32_t lsm6dsr_int_notification_get(const stmdev_ctx_t *ctx,
                                     lsm6dsr_lir_t *val);

typedef enum
{
  LSM6DSR_LSb_FS_DIV_64       = 0,
  LSM6DSR_LSb_FS_DIV_256      = 1,
} lsm6dsr_wake_ths_w_t;
int32_t lsm6dsr_wkup_ths_weight_set(const stmdev_ctx_t *ctx,
                                    lsm6dsr_wake_ths_w_t val);
int32_t lsm6dsr_wkup_ths_weight_get(const stmdev_ctx_t *ctx,
                                    lsm6dsr_wake_ths_w_t *val);

int32_t lsm6dsr_wkup_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_wkup_threshold_get(const stmdev_ctx_t *ctx,
                                   uint8_t *val);

int32_t lsm6dsr_xl_usr_offset_on_wkup_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t lsm6dsr_xl_usr_offset_on_wkup_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t lsm6dsr_wkup_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_wkup_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_gy_sleep_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_gy_sleep_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_DRIVE_SLEEP_CHG_EVENT = 0,
  LSM6DSR_DRIVE_SLEEP_STATUS    = 1,
} lsm6dsr_sleep_status_on_int_t;
int32_t lsm6dsr_act_pin_notification_set(const stmdev_ctx_t *ctx,
                                         lsm6dsr_sleep_status_on_int_t val);
int32_t lsm6dsr_act_pin_notification_get(const stmdev_ctx_t *ctx,
                                         lsm6dsr_sleep_status_on_int_t *val);

typedef enum
{
  LSM6DSR_XL_AND_GY_NOT_AFFECTED      = 0,
  LSM6DSR_XL_12Hz5_GY_NOT_AFFECTED    = 1,
  LSM6DSR_XL_12Hz5_GY_SLEEP           = 2,
  LSM6DSR_XL_12Hz5_GY_PD              = 3,
} lsm6dsr_inact_en_t;
int32_t lsm6dsr_act_mode_set(const stmdev_ctx_t *ctx,
                             lsm6dsr_inact_en_t val);
int32_t lsm6dsr_act_mode_get(const stmdev_ctx_t *ctx,
                             lsm6dsr_inact_en_t *val);

int32_t lsm6dsr_act_sleep_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_act_sleep_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_detection_on_z_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsr_tap_detection_on_z_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsr_tap_detection_on_y_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsr_tap_detection_on_y_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsr_tap_detection_on_x_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsr_tap_detection_on_x_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsr_tap_threshold_x_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_tap_threshold_x_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

