ForgetfulDuck/MIP-Watch/MIP-STM32/Core/Inc/lsm6dsr_reg.h
typedef enum
{
  LSM6DSR_XYZ = 0,
  LSM6DSR_YXZ = 1,
  LSM6DSR_XZY = 2,
  LSM6DSR_ZYX = 3,
  LSM6DSR_YZX = 5,
  LSM6DSR_ZXY = 6,
} lsm6dsr_tap_priority_t;
int32_t lsm6dsr_tap_axis_priority_set(const stmdev_ctx_t *ctx,
                                      lsm6dsr_tap_priority_t val);
int32_t lsm6dsr_tap_axis_priority_get(const stmdev_ctx_t *ctx,
                                      lsm6dsr_tap_priority_t *val);

int32_t lsm6dsr_tap_threshold_y_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_tap_threshold_y_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

int32_t lsm6dsr_tap_threshold_z_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_tap_threshold_z_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

int32_t lsm6dsr_tap_shock_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_shock_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_quiet_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_quiet_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tap_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tap_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_ONLY_SINGLE        = 0,
  LSM6DSR_BOTH_SINGLE_DOUBLE = 1,
} lsm6dsr_single_double_tap_t;
int32_t lsm6dsr_tap_mode_set(const stmdev_ctx_t *ctx,
                             lsm6dsr_single_double_tap_t val);
int32_t lsm6dsr_tap_mode_get(const stmdev_ctx_t *ctx,
                             lsm6dsr_single_double_tap_t *val);

typedef enum
{
  LSM6DSR_DEG_80  = 0,
  LSM6DSR_DEG_70  = 1,
  LSM6DSR_DEG_60  = 2,
  LSM6DSR_DEG_50  = 3,
} lsm6dsr_sixd_ths_t;
int32_t lsm6dsr_6d_threshold_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sixd_ths_t val);
int32_t lsm6dsr_6d_threshold_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sixd_ths_t *val);

int32_t lsm6dsr_4d_mode_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_4d_mode_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_FF_TSH_156mg = 0,
  LSM6DSR_FF_TSH_219mg = 1,
  LSM6DSR_FF_TSH_250mg = 2,
  LSM6DSR_FF_TSH_312mg = 3,
  LSM6DSR_FF_TSH_344mg = 4,
  LSM6DSR_FF_TSH_406mg = 5,
  LSM6DSR_FF_TSH_469mg = 6,
  LSM6DSR_FF_TSH_500mg = 7,
} lsm6dsr_ff_ths_t;
int32_t lsm6dsr_ff_threshold_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_ff_ths_t val);
int32_t lsm6dsr_ff_threshold_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_ff_ths_t *val);

int32_t lsm6dsr_ff_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_ff_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_fifo_watermark_set(const stmdev_ctx_t *ctx,
                                   uint16_t val);
int32_t lsm6dsr_fifo_watermark_get(const stmdev_ctx_t *ctx,
                                   uint16_t *val);

int32_t lsm6dsr_compression_algo_init_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t lsm6dsr_compression_algo_init_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

typedef enum
{
  LSM6DSR_CMP_DISABLE  = 0x00,
  LSM6DSR_CMP_ALWAYS   = 0x04,
  LSM6DSR_CMP_8_TO_1   = 0x05,
  LSM6DSR_CMP_16_TO_1  = 0x06,
  LSM6DSR_CMP_32_TO_1  = 0x07,
} lsm6dsr_uncoptr_rate_t;
int32_t lsm6dsr_compression_algo_set(const stmdev_ctx_t *ctx,
                                     lsm6dsr_uncoptr_rate_t val);
int32_t lsm6dsr_compression_algo_get(const stmdev_ctx_t *ctx,
                                     lsm6dsr_uncoptr_rate_t *val);

int32_t lsm6dsr_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                              uint8_t val);
int32_t lsm6dsr_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                              uint8_t *val);

int32_t lsm6dsr_compression_algo_real_time_set(const stmdev_ctx_t *ctx,
                                               uint8_t val);
int32_t lsm6dsr_compression_algo_real_time_get(const stmdev_ctx_t *ctx,
                                               uint8_t *val);

int32_t lsm6dsr_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx,
                                     uint8_t val);
int32_t lsm6dsr_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx,
                                     uint8_t *val);

typedef enum
{
  LSM6DSR_XL_NOT_BATCHED       =  0,
  LSM6DSR_XL_BATCHED_AT_12Hz5   =  1,
  LSM6DSR_XL_BATCHED_AT_26Hz    =  2,
  LSM6DSR_XL_BATCHED_AT_52Hz    =  3,
  LSM6DSR_XL_BATCHED_AT_104Hz   =  4,
  LSM6DSR_XL_BATCHED_AT_208Hz   =  5,
  LSM6DSR_XL_BATCHED_AT_417Hz   =  6,
  LSM6DSR_XL_BATCHED_AT_833Hz   =  7,
  LSM6DSR_XL_BATCHED_AT_1667Hz  =  8,
  LSM6DSR_XL_BATCHED_AT_3333Hz  =  9,
  LSM6DSR_XL_BATCHED_AT_6667Hz  = 10,
  LSM6DSR_XL_BATCHED_AT_6Hz5    = 11,
} lsm6dsr_bdr_xl_t;
int32_t lsm6dsr_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                  lsm6dsr_bdr_xl_t val);
int32_t lsm6dsr_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                  lsm6dsr_bdr_xl_t *val);

typedef enum
{
  LSM6DSR_GY_NOT_BATCHED         = 0,
  LSM6DSR_GY_BATCHED_AT_12Hz5    = 1,
  LSM6DSR_GY_BATCHED_AT_26Hz     = 2,
  LSM6DSR_GY_BATCHED_AT_52Hz     = 3,
  LSM6DSR_GY_BATCHED_AT_104Hz    = 4,
  LSM6DSR_GY_BATCHED_AT_208Hz    = 5,
  LSM6DSR_GY_BATCHED_AT_417Hz    = 6,
  LSM6DSR_GY_BATCHED_AT_833Hz    = 7,
  LSM6DSR_GY_BATCHED_AT_1667Hz   = 8,
  LSM6DSR_GY_BATCHED_AT_3333Hz   = 9,
  LSM6DSR_GY_BATCHED_AT_6667Hz   = 10,
  LSM6DSR_GY_BATCHED_6Hz5        = 11,
} lsm6dsr_bdr_gy_t;
int32_t lsm6dsr_fifo_gy_batch_set(const stmdev_ctx_t *ctx,
                                  lsm6dsr_bdr_gy_t val);
int32_t lsm6dsr_fifo_gy_batch_get(const stmdev_ctx_t *ctx,
                                  lsm6dsr_bdr_gy_t *val);

typedef enum
{
  LSM6DSR_BYPASS_MODE             = 0,
  LSM6DSR_FIFO_MODE               = 1,
  LSM6DSR_STREAM_TO_FIFO_MODE     = 3,
  LSM6DSR_BYPASS_TO_STREAM_MODE   = 4,
  LSM6DSR_STREAM_MODE             = 6,
  LSM6DSR_BYPASS_TO_FIFO_MODE     = 7,
} lsm6dsr_fifo_mode_t;
int32_t lsm6dsr_fifo_mode_set(const stmdev_ctx_t *ctx,
                              lsm6dsr_fifo_mode_t val);
int32_t lsm6dsr_fifo_mode_get(const stmdev_ctx_t *ctx,
                              lsm6dsr_fifo_mode_t *val);

