ForgetfulDuck/MIP-Watch/MIP-STM32/Core/Inc/lsm6dsr_reg.h
typedef enum
{
  LSM6DSR_TEMP_NOT_BATCHED        = 0,
  LSM6DSR_TEMP_BATCHED_AT_52Hz    = 1,
  LSM6DSR_TEMP_BATCHED_AT_12Hz5   = 2,
  LSM6DSR_TEMP_BATCHED_AT_1Hz6    = 3,
} lsm6dsr_odr_t_batch_t;
int32_t lsm6dsr_fifo_temp_batch_set(const stmdev_ctx_t *ctx,
                                    lsm6dsr_odr_t_batch_t val);
int32_t lsm6dsr_fifo_temp_batch_get(const stmdev_ctx_t *ctx,
                                    lsm6dsr_odr_t_batch_t *val);

typedef enum
{
  LSM6DSR_NO_DECIMATION = 0,
  LSM6DSR_DEC_1         = 1,
  LSM6DSR_DEC_8         = 2,
  LSM6DSR_DEC_32        = 3,
} lsm6dsr_odr_ts_batch_t;
int32_t lsm6dsr_fifo_timestamp_decimation_set(const stmdev_ctx_t *ctx,
                                              lsm6dsr_odr_ts_batch_t val);
int32_t lsm6dsr_fifo_timestamp_decimation_get(const stmdev_ctx_t *ctx,
                                              lsm6dsr_odr_ts_batch_t *val);

typedef enum
{
  LSM6DSR_XL_BATCH_EVENT   = 0,
  LSM6DSR_GYRO_BATCH_EVENT = 1,
} lsm6dsr_trig_counter_bdr_t;
int32_t lsm6dsr_fifo_cnt_event_batch_set(const stmdev_ctx_t *ctx,
                                         lsm6dsr_trig_counter_bdr_t val);
int32_t lsm6dsr_fifo_cnt_event_batch_get(const stmdev_ctx_t *ctx,
                                         lsm6dsr_trig_counter_bdr_t *val);

int32_t lsm6dsr_rst_batch_counter_set(const stmdev_ctx_t *ctx,
                                      uint8_t val);
int32_t lsm6dsr_rst_batch_counter_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t lsm6dsr_batch_counter_threshold_set(const stmdev_ctx_t *ctx,
                                            uint16_t val);
int32_t lsm6dsr_batch_counter_threshold_get(const stmdev_ctx_t *ctx,
                                            uint16_t *val);

int32_t lsm6dsr_fifo_data_level_get(const stmdev_ctx_t *ctx,
                                    uint16_t *val);

int32_t lsm6dsr_fifo_status_get(const stmdev_ctx_t *ctx,
                                lsm6dsr_fifo_status2_t *val);

int32_t lsm6dsr_fifo_full_flag_get(const stmdev_ctx_t *ctx,
                                   uint8_t *val);

int32_t lsm6dsr_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_GYRO_NC_TAG    = 1,
  LSM6DSR_XL_NC_TAG,
  LSM6DSR_TEMPERATURE_TAG,
  LSM6DSR_TIMESTAMP_TAG,
  LSM6DSR_CFG_CHANGE_TAG,
  LSM6DSR_XL_NC_T_2_TAG,
  LSM6DSR_XL_NC_T_1_TAG,
  LSM6DSR_XL_2XC_TAG,
  LSM6DSR_XL_3XC_TAG,
  LSM6DSR_GYRO_NC_T_2_TAG,
  LSM6DSR_GYRO_NC_T_1_TAG,
  LSM6DSR_GYRO_2XC_TAG,
  LSM6DSR_GYRO_3XC_TAG,
  LSM6DSR_SENSORHUB_SLAVE0_TAG,
  LSM6DSR_SENSORHUB_SLAVE1_TAG,
  LSM6DSR_SENSORHUB_SLAVE2_TAG,
  LSM6DSR_SENSORHUB_SLAVE3_TAG,
  LSM6DSR_STEP_COUNTER_TAG,
  LSM6DSR_SENSORHUB_NACK_TAG = 0x19,
} lsm6dsr_fifo_tag_t;
int32_t lsm6dsr_fifo_sensor_tag_get(const stmdev_ctx_t *ctx,
                                    lsm6dsr_fifo_tag_t *val);

int32_t lsm6dsr_fifo_pedo_batch_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_fifo_pedo_batch_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_0_set(const stmdev_ctx_t *ctx,
                                     uint8_t val);
int32_t lsm6dsr_sh_batch_slave_0_get(const stmdev_ctx_t *ctx,
                                     uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_1_set(const stmdev_ctx_t *ctx,
                                     uint8_t val);
int32_t lsm6dsr_sh_batch_slave_1_get(const stmdev_ctx_t *ctx,
                                     uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_2_set(const stmdev_ctx_t *ctx,
                                     uint8_t val);
int32_t lsm6dsr_sh_batch_slave_2_get(const stmdev_ctx_t *ctx,
                                     uint8_t *val);

int32_t lsm6dsr_sh_batch_slave_3_set(const stmdev_ctx_t *ctx,
                                     uint8_t val);
int32_t lsm6dsr_sh_batch_slave_3_get(const stmdev_ctx_t *ctx,
                                     uint8_t *val);

typedef enum
{
  LSM6DSR_DEN_DISABLE    = 0,
  LSM6DSR_LEVEL_FIFO     = 6,
  LSM6DSR_LEVEL_LETCHED  = 3,
  LSM6DSR_LEVEL_TRIGGER  = 2,
  LSM6DSR_EDGE_TRIGGER   = 4,
} lsm6dsr_den_mode_t;
int32_t lsm6dsr_den_mode_set(const stmdev_ctx_t *ctx,
                             lsm6dsr_den_mode_t val);
int32_t lsm6dsr_den_mode_get(const stmdev_ctx_t *ctx,
                             lsm6dsr_den_mode_t *val);

typedef enum
{
  LSM6DSR_DEN_ACT_LOW  = 0,
  LSM6DSR_DEN_ACT_HIGH = 1,
} lsm6dsr_den_lh_t;
int32_t lsm6dsr_den_polarity_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_den_lh_t val);
int32_t lsm6dsr_den_polarity_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_den_lh_t *val);

typedef enum
{
  LSM6DSR_STAMP_IN_GY_DATA     = 0,
  LSM6DSR_STAMP_IN_XL_DATA     = 1,
  LSM6DSR_STAMP_IN_GY_XL_DATA  = 2,
} lsm6dsr_den_xl_g_t;
int32_t lsm6dsr_den_enable_set(const stmdev_ctx_t *ctx,
                               lsm6dsr_den_xl_g_t val);
int32_t lsm6dsr_den_enable_get(const stmdev_ctx_t *ctx,
                               lsm6dsr_den_xl_g_t *val);

int32_t lsm6dsr_den_mark_axis_x_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_den_mark_axis_x_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

int32_t lsm6dsr_den_mark_axis_y_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_den_mark_axis_y_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

int32_t lsm6dsr_den_mark_axis_z_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_den_mark_axis_z_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

int32_t lsm6dsr_pedo_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_pedo_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_PEDO_BASE                = 0x00,
  LSM6DSR_PEDO_BASE_FALSE_STEP_REJ = 0x01,
  LSM6DSR_PEDO_ADV_FALSE_STEP_REJ  = 0x03,
} lsm6dsr_pedo_mode_t;
int32_t lsm6dsr_pedo_mode_set(const stmdev_ctx_t *ctx,
                              lsm6dsr_pedo_mode_t val);
int32_t lsm6dsr_pedo_mode_get(const stmdev_ctx_t *ctx,
                              lsm6dsr_pedo_mode_t *val);

int32_t lsm6dsr_pedo_step_detect_get(const stmdev_ctx_t *ctx,
                                     uint8_t *val);

int32_t lsm6dsr_pedo_debounce_steps_set(const stmdev_ctx_t *ctx,
                                        uint8_t *val);
int32_t lsm6dsr_pedo_debounce_steps_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

