ForgetfulDuck/MIP-Watch/MIP-STM32/Core/Inc/lsm6dsr_reg.h
int32_t lsm6dsr_pedo_steps_period_set(const stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t lsm6dsr_pedo_steps_period_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t lsm6dsr_pedo_adv_detection_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t lsm6dsr_pedo_adv_detection_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t lsm6dsr_pedo_false_step_rejection_set(const stmdev_ctx_t *ctx,
                                              uint8_t val);
int32_t lsm6dsr_pedo_false_step_rejection_get(const stmdev_ctx_t *ctx,
                                              uint8_t *val);

typedef enum
{
  LSM6DSR_EVERY_STEP     = 0,
  LSM6DSR_COUNT_OVERFLOW = 1,
} lsm6dsr_carry_count_en_t;
int32_t lsm6dsr_pedo_int_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dsr_carry_count_en_t val);
int32_t lsm6dsr_pedo_int_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dsr_carry_count_en_t *val);

int32_t lsm6dsr_motion_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_motion_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_motion_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsr_tilt_sens_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_tilt_sens_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_tilt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dsr_mag_sensitivity_set(const stmdev_ctx_t *ctx,
                                    uint16_t val);
int32_t lsm6dsr_mag_sensitivity_get(const stmdev_ctx_t *ctx,
                                    uint16_t *val);

int32_t lsm6dsr_mag_offset_set(const stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dsr_mag_offset_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dsr_mag_soft_iron_set(const stmdev_ctx_t *ctx,
                                  uint16_t *val);
int32_t lsm6dsr_mag_soft_iron_get(const stmdev_ctx_t *ctx,
                                  uint16_t *val);

typedef enum
{
  LSM6DSR_Z_EQ_Y     = 0,
  LSM6DSR_Z_EQ_MIN_Y = 1,
  LSM6DSR_Z_EQ_X     = 2,
  LSM6DSR_Z_EQ_MIN_X = 3,
  LSM6DSR_Z_EQ_MIN_Z = 4,
  LSM6DSR_Z_EQ_Z     = 5,
} lsm6dsr_mag_z_axis_t;
int32_t lsm6dsr_mag_z_orient_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_mag_z_axis_t val);
int32_t lsm6dsr_mag_z_orient_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_mag_z_axis_t *val);

typedef enum
{
  LSM6DSR_Y_EQ_Y     = 0,
  LSM6DSR_Y_EQ_MIN_Y = 1,
  LSM6DSR_Y_EQ_X     = 2,
  LSM6DSR_Y_EQ_MIN_X = 3,
  LSM6DSR_Y_EQ_MIN_Z = 4,
  LSM6DSR_Y_EQ_Z     = 5,
} lsm6dsr_mag_y_axis_t;
int32_t lsm6dsr_mag_y_orient_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_mag_y_axis_t val);
int32_t lsm6dsr_mag_y_orient_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_mag_y_axis_t *val);

typedef enum
{
  LSM6DSR_X_EQ_Y     = 0,
  LSM6DSR_X_EQ_MIN_Y = 1,
  LSM6DSR_X_EQ_X     = 2,
  LSM6DSR_X_EQ_MIN_X = 3,
  LSM6DSR_X_EQ_MIN_Z = 4,
  LSM6DSR_X_EQ_Z     = 5,
} lsm6dsr_mag_x_axis_t;
int32_t lsm6dsr_mag_x_orient_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_mag_x_axis_t val);
int32_t lsm6dsr_mag_x_orient_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_mag_x_axis_t *val);

int32_t lsm6dsr_long_cnt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                             uint8_t *val);

int32_t lsm6dsr_emb_fsm_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_emb_fsm_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  lsm6dsr_fsm_enable_a_t          fsm_enable_a;
  lsm6dsr_fsm_enable_b_t          fsm_enable_b;
} lsm6dsr_emb_fsm_enable_t;
int32_t lsm6dsr_fsm_enable_set(const stmdev_ctx_t *ctx,
                               lsm6dsr_emb_fsm_enable_t *val);
int32_t lsm6dsr_fsm_enable_get(const stmdev_ctx_t *ctx,
                               lsm6dsr_emb_fsm_enable_t *val);

int32_t lsm6dsr_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsr_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef enum
{
  LSM6DSR_LC_NORMAL     = 0,
  LSM6DSR_LC_CLEAR      = 1,
  LSM6DSR_LC_CLEAR_DONE = 2,
} lsm6dsr_fsm_lc_clr_t;
int32_t lsm6dsr_long_clr_set(const stmdev_ctx_t *ctx,
                             lsm6dsr_fsm_lc_clr_t val);
int32_t lsm6dsr_long_clr_get(const stmdev_ctx_t *ctx,
                             lsm6dsr_fsm_lc_clr_t *val);

typedef struct
{
  lsm6dsr_fsm_outs1_t    fsm_outs1;
  lsm6dsr_fsm_outs2_t    fsm_outs2;
  lsm6dsr_fsm_outs3_t    fsm_outs3;
  lsm6dsr_fsm_outs4_t    fsm_outs4;
  lsm6dsr_fsm_outs5_t    fsm_outs5;
  lsm6dsr_fsm_outs6_t    fsm_outs6;
  lsm6dsr_fsm_outs7_t    fsm_outs7;
  lsm6dsr_fsm_outs8_t    fsm_outs8;
  lsm6dsr_fsm_outs9_t    fsm_outs9;
  lsm6dsr_fsm_outs10_t    fsm_outs10;
  lsm6dsr_fsm_outs11_t    fsm_outs11;
  lsm6dsr_fsm_outs12_t    fsm_outs12;
  lsm6dsr_fsm_outs13_t    fsm_outs13;
  lsm6dsr_fsm_outs14_t    fsm_outs14;
  lsm6dsr_fsm_outs15_t    fsm_outs15;
  lsm6dsr_fsm_outs16_t    fsm_outs16;
} lsm6dsr_fsm_out_t;
int32_t lsm6dsr_fsm_out_get(const stmdev_ctx_t *ctx,
                            lsm6dsr_fsm_out_t *val);

typedef enum
{
  LSM6DSR_ODR_FSM_12Hz5 = 0,
  LSM6DSR_ODR_FSM_26Hz  = 1,
  LSM6DSR_ODR_FSM_52Hz  = 2,
  LSM6DSR_ODR_FSM_104Hz = 3,
} lsm6dsr_fsm_odr_t;
int32_t lsm6dsr_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                  lsm6dsr_fsm_odr_t val);
int32_t lsm6dsr_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                  lsm6dsr_fsm_odr_t *val);

int32_t lsm6dsr_fsm_init_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_fsm_init_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_long_cnt_int_value_set(const stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t lsm6dsr_long_cnt_int_value_get(const stmdev_ctx_t *ctx,
                                       uint16_t *val);

