ForgetfulDuck/MIP-Watch/MIP-STM32/Core/Inc/lsm6dsr_reg.h
int32_t lsm6dsr_fsm_number_of_programs_set(const stmdev_ctx_t *ctx,
                                           uint8_t *val);
int32_t lsm6dsr_fsm_number_of_programs_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dsr_fsm_start_address_set(const stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t lsm6dsr_fsm_start_address_get(const stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t lsm6dsr_sh_read_data_raw_get(const stmdev_ctx_t *ctx, uint8_t *val,
                                     uint8_t len);

typedef enum
{
  LSM6DSR_SLV_0       = 0,
  LSM6DSR_SLV_0_1     = 1,
  LSM6DSR_SLV_0_1_2   = 2,
  LSM6DSR_SLV_0_1_2_3 = 3,
} lsm6dsr_aux_sens_on_t;
int32_t lsm6dsr_sh_slave_connected_set(const stmdev_ctx_t *ctx,
                                       lsm6dsr_aux_sens_on_t val);
int32_t lsm6dsr_sh_slave_connected_get(const stmdev_ctx_t *ctx,
                                       lsm6dsr_aux_sens_on_t *val);

int32_t lsm6dsr_sh_master_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_sh_master_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_EXT_PULL_UP      = 0,
  LSM6DSR_INTERNAL_PULL_UP = 1,
} lsm6dsr_shub_pu_en_t;
int32_t lsm6dsr_sh_pin_mode_set(const stmdev_ctx_t *ctx,
                                lsm6dsr_shub_pu_en_t val);
int32_t lsm6dsr_sh_pin_mode_get(const stmdev_ctx_t *ctx,
                                lsm6dsr_shub_pu_en_t *val);

int32_t lsm6dsr_sh_pass_through_set(const stmdev_ctx_t *ctx,
                                    uint8_t val);
int32_t lsm6dsr_sh_pass_through_get(const stmdev_ctx_t *ctx,
                                    uint8_t *val);

typedef enum
{
  LSM6DSR_EXT_ON_INT2_PIN = 1,
  LSM6DSR_XL_GY_DRDY      = 0,
} lsm6dsr_start_config_t;
int32_t lsm6dsr_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                   lsm6dsr_start_config_t val);
int32_t lsm6dsr_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                   lsm6dsr_start_config_t *val);

typedef enum
{
  LSM6DSR_EACH_SH_CYCLE    = 0,
  LSM6DSR_ONLY_FIRST_CYCLE = 1,
} lsm6dsr_write_once_t;
int32_t lsm6dsr_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                  lsm6dsr_write_once_t val);
int32_t lsm6dsr_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                  lsm6dsr_write_once_t *val);

int32_t lsm6dsr_sh_reset_set(const stmdev_ctx_t *ctx);
int32_t lsm6dsr_sh_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  LSM6DSR_SH_ODR_104Hz = 0,
  LSM6DSR_SH_ODR_52Hz  = 1,
  LSM6DSR_SH_ODR_26Hz  = 2,
  LSM6DSR_SH_ODR_13Hz  = 3,
} lsm6dsr_shub_odr_t;
int32_t lsm6dsr_sh_data_rate_set(const stmdev_ctx_t *ctx,
                                 lsm6dsr_shub_odr_t val);
int32_t lsm6dsr_sh_data_rate_get(const stmdev_ctx_t *ctx,
                                 lsm6dsr_shub_odr_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} lsm6dsr_sh_cfg_write_t;
int32_t lsm6dsr_sh_cfg_write(const stmdev_ctx_t *ctx,
                             lsm6dsr_sh_cfg_write_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} lsm6dsr_sh_cfg_read_t;
int32_t lsm6dsr_sh_slv0_cfg_read(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);
int32_t lsm6dsr_sh_slv1_cfg_read(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);
int32_t lsm6dsr_sh_slv2_cfg_read(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);
int32_t lsm6dsr_sh_slv3_cfg_read(const stmdev_ctx_t *ctx,
                                 lsm6dsr_sh_cfg_read_t *val);

int32_t lsm6dsr_sh_status_get(const stmdev_ctx_t *ctx,
                              lsm6dsr_status_master_t *val);

typedef enum
{
  LSM6DSR_S4S_TPH_7bit   = 0,
  LSM6DSR_S4S_TPH_15bit  = 1,
} lsm6dsr_s4s_tph_res_t;
int32_t lsm6dsr_s4s_tph_res_set(const stmdev_ctx_t *ctx,
                                lsm6dsr_s4s_tph_res_t val);
int32_t lsm6dsr_s4s_tph_res_get(const stmdev_ctx_t *ctx,
                                lsm6dsr_s4s_tph_res_t *val);

int32_t lsm6dsr_s4s_tph_val_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dsr_s4s_tph_val_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef enum
{
  LSM6DSR_S4S_DT_RES_11 = 0,
  LSM6DSR_S4S_DT_RES_12 = 1,
  LSM6DSR_S4S_DT_RES_13 = 2,
  LSM6DSR_S4S_DT_RES_14 = 3,
} lsm6dsr_s4s_res_ratio_t;
int32_t lsm6dsr_s4s_res_ratio_set(const stmdev_ctx_t *ctx,
                                  lsm6dsr_s4s_res_ratio_t val);
int32_t lsm6dsr_s4s_res_ratio_get(const stmdev_ctx_t *ctx,
                                  lsm6dsr_s4s_res_ratio_t *val);

int32_t lsm6dsr_s4s_command_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_s4s_command_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dsr_s4s_dt_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dsr_s4s_dt_get(const stmdev_ctx_t *ctx, uint8_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* LSM6DSR_REGS_H */

